<template>
  <q-page>
    <div class="row flex justify-center">
      <div class="col-4">
        <q-card flat class="my-card col-4 q-col-gutter-xs q-my-xl q-py-xl">
          <q-tabs
              v-model="tab"
              class="text-dark title-button q-mx-md"
              active-color="dark"
              indicator-color="yellow"
              align="justify"
              dense
          >
            <q-tab class="q-pa-sm" name="login" label="Авторизация"/>
            <q-tab class="q-pa-sm" name="registration" label="Регистрация" />
          </q-tabs>
          <q-tab-panels v-model="tab" animated>
            <q-tab-panel name="login">
              <div class="text-mini">Авторизуйтесь в системе для доступа к образовательным курсам</div>
              <q-input outlined type="text" class=" q-my-md" v-model="user.email" placeholder="Введите ваш e-mail..." />
              <q-input outlined type="text" class="q-my-md" v-model="user.password" placeholder="Введите ваш пароль..." />
              <div class="text-mini-y">Я забыл свой пароль </div>
              <q-btn color="yellow" class="q-my-md q-mx-xs" size="16px" @click="loginUser" style="width: 100%" label="Войти" />
              <div class="text-mini">Войти через социальные сети</div>
              <a  href="https://accounts.google.com/signin/oauth/identifier?client_id=217991563041-24mhrqea2jnlv4gjrgbddrfqhdqoo84v.apps.googleusercontent.com&as=UK_8znqMTf-n4c7AITtvDg&destination=http%3A%2F%2F127.0.0.1%3A8081&approval_state=!ChRwM2JRbEEzal81MmN5V203cnROWBIfQXoyUHhHQy1yQ01kOERFdWhZOThQYy1WOEVfbEJoYw%E2%88%99AF-3PDcAAAAAXlLPtYxxda6HIUBD2Uctdf8rXKX1FaBf&oauthgdpr=1&xsrfsig=ChkAeAh8Tx811tvNPT4F823aQZDuE3a2LJecEg5hcHByb3ZhbF9zdGF0ZRILZGVzdGluYXRpb24SBXNvYWN1Eg9vYXV0aHJpc2t5c2NvcGU&flowName=GeneralOAuthFlow">
                <svg class="q-my-md" xmlns="http://www.w3.org/2000/svg" width="65" height="46" viewBox="0 0 65 46" fill="none">
                  <path d="M24.8 26.2206L23.9205 29.7274L20.7057 29.8C19.745 27.8968 19.2 25.7194 19.2 23.4055C19.2 21.168 19.7095 19.0579 20.6127 17.2H20.6134L23.4754 17.7604L24.7291 20.7987C24.4667 21.6158 24.3237 22.4928 24.3237 23.4055C24.3238 24.396 24.4918 25.345 24.8 26.2206Z" fill="#FBBB00"/>
                  <path d="M45.5624 20.7C45.7186 21.5323 45.8 22.3919 45.8 23.2703C45.8 24.2554 45.6976 25.2162 45.5026 26.1431C44.8406 29.297 43.1109 32.0511 40.7146 34L40.7139 33.9992L36.8337 33.7989L36.2846 30.3305C37.8746 29.387 39.1172 27.9106 39.7717 26.1431H32.5V20.7H39.8778H45.5624Z" fill="#518EF8"/>
                  <path d="M40.8992 33.8781L40.9 33.8788C38.5913 35.7065 35.6586 36.8 32.4661 36.8C27.3358 36.8 22.8754 33.9758 20.6 29.8197L24.9657 26.3C26.1034 29.2904 29.0323 31.4192 32.4661 31.4192C33.9421 31.4192 35.3248 31.0262 36.5113 30.3402L40.8992 33.8781Z" fill="#28B446"/>
                  <path d="M40.9 13.1961L36.5918 16.6477C35.3796 15.9062 33.9467 15.4779 32.4116 15.4779C28.9452 15.4779 25.9998 17.6616 24.933 20.7L20.6007 17.2291H20.6C22.8132 13.0531 27.2719 10.2 32.4116 10.2C35.6383 10.2 38.5968 11.3248 40.9 13.1961Z" fill="#F14336"/>
                  <rect x="0.5" y="0.5" width="64" height="45" rx="1.5" stroke="black" stroke-opacity="0.12"/>
                </svg>
              </a>
              <a href="https://oauth.vk.com/authorize?client_id=7315382&redirect_uri=http%3A%2F%2F127.0.0.1%3A8081%2Fsuccess&scope=email&response_type=code">
                <svg class="q-ma-md" xmlns="http://www.w3.org/2000/svg" width="65" height="46" viewBox="0 0 65 46" fill="none">
                  <g clip-path="url(#clip0)">
                    <path d="M49.8145 31.5498C49.7721 31.4585 49.7326 31.3827 49.6959 31.322C49.0886 30.2283 47.9282 28.8859 46.2153 27.2944L46.1791 27.2579L46.1609 27.2401L46.1426 27.2218H46.1242C45.3468 26.4807 44.8545 25.9824 44.6484 25.7272C44.2712 25.2413 44.1866 24.7494 44.3928 24.2509C44.5385 23.8743 45.0856 23.0791 46.0329 21.864C46.5312 21.22 46.9258 20.7039 47.2173 20.3151C49.3192 17.5208 50.2304 15.7351 49.9509 14.9575L49.8423 14.7758C49.7693 14.6664 49.581 14.5663 49.2777 14.4751C48.9736 14.384 48.585 14.3689 48.111 14.4296L42.8629 14.4659C42.7779 14.4358 42.6565 14.4386 42.4984 14.4751C42.3404 14.5116 42.2614 14.5299 42.2614 14.5299L42.17 14.5755L42.0975 14.6304C42.0368 14.6666 41.9699 14.7304 41.897 14.8215C41.8244 14.9123 41.7637 15.0189 41.7152 15.1404C41.1438 16.6104 40.4942 17.9771 39.7651 19.2405C39.3156 19.9939 38.9027 20.6467 38.5257 21.1996C38.1492 21.7522 37.8333 22.1593 37.5784 22.4203C37.3231 22.6816 37.0927 22.8908 36.8857 23.0489C36.6791 23.2071 36.5214 23.2739 36.4122 23.2495C36.3027 23.225 36.1997 23.2008 36.1021 23.1765C35.9321 23.0671 35.7954 22.9184 35.6923 22.7301C35.5888 22.5418 35.5191 22.3048 35.4826 22.0193C35.4464 21.7336 35.4249 21.4879 35.4188 21.2813C35.4131 21.0749 35.4157 20.783 35.4281 20.4064C35.4407 20.0297 35.4464 19.7747 35.4464 19.6411C35.4464 19.1794 35.4554 18.6783 35.4734 18.1376C35.4918 17.597 35.5067 17.1687 35.5191 16.8531C35.5315 16.5373 35.5373 16.2031 35.5373 15.8507C35.5373 15.4984 35.5158 15.2221 35.4734 15.0216C35.4316 14.8213 35.3673 14.6268 35.2826 14.4384C35.1974 14.2501 35.0727 14.1044 34.909 14.001C34.7451 13.8978 34.5412 13.8158 34.2986 13.7549C33.6546 13.6092 32.8346 13.5304 31.8382 13.5181C29.5787 13.4939 28.1268 13.6398 27.483 13.9556C27.2278 14.0891 26.997 14.2715 26.7906 14.5021C26.5718 14.7695 26.5413 14.9154 26.6992 14.9394C27.4283 15.0486 27.9444 15.3099 28.2481 15.7229L28.3576 15.9417C28.4427 16.0997 28.5277 16.3792 28.6128 16.7801C28.6978 17.1809 28.7526 17.6243 28.7767 18.11C28.8374 18.997 28.8374 19.7563 28.7767 20.3879C28.7159 21.0198 28.6585 21.5117 28.6036 21.8641C28.5488 22.2164 28.4668 22.5019 28.3576 22.7205C28.2481 22.9392 28.1753 23.0728 28.1388 23.1213C28.1023 23.1698 28.0719 23.2004 28.0478 23.2124C27.8899 23.2729 27.7257 23.3037 27.5557 23.3037C27.3855 23.3037 27.1791 23.2186 26.9361 23.0484C26.6933 22.8783 26.4412 22.6445 26.18 22.3468C25.9187 22.0491 25.6241 21.633 25.296 21.0985C24.9681 20.564 24.6279 19.9323 24.2756 19.2034L23.9841 18.6748C23.8019 18.3347 23.5529 17.8396 23.2371 17.1898C22.921 16.5397 22.6416 15.9109 22.3988 15.3034C22.3017 15.0483 22.1558 14.8541 21.9615 14.7204L21.8703 14.6656C21.8096 14.6171 21.7123 14.5656 21.5788 14.5107C21.4451 14.4559 21.3055 14.4165 21.1596 14.3923L16.1665 14.4286C15.6563 14.4286 15.3101 14.5442 15.1278 14.7751L15.0548 14.8843C15.0184 14.9451 15 15.0422 15 15.176C15 15.3096 15.0364 15.4736 15.1094 15.6679C15.8383 17.381 16.631 19.0331 17.4874 20.6246C18.3438 22.2161 19.0881 23.498 19.7196 24.4693C20.3513 25.4414 20.9952 26.3587 21.6513 27.2211C22.3074 28.0837 22.7416 28.6365 22.9541 28.8793C23.1668 29.1226 23.3339 29.3046 23.4554 29.426L23.9111 29.8633C24.2026 30.1549 24.6308 30.5042 25.1957 30.9111C25.7608 31.3182 26.3863 31.7191 27.0727 32.1142C27.7593 32.5087 28.5579 32.8307 29.4692 33.0797C30.3803 33.3289 31.2671 33.4289 32.1297 33.3807H34.2254C34.6505 33.344 34.9725 33.2103 35.1913 32.9796L35.2638 32.8883C35.3126 32.8158 35.3582 32.7031 35.4004 32.5516C35.443 32.3997 35.4642 32.2324 35.4642 32.0505C35.4517 31.5282 35.4915 31.0574 35.5824 30.6383C35.6732 30.2194 35.7767 29.9035 35.8925 29.6908C36.0082 29.4782 36.1388 29.2989 36.2842 29.1535C36.4298 29.0078 36.5336 28.9195 36.5945 28.8891C36.655 28.8585 36.7033 28.8378 36.7398 28.8253C37.0313 28.7282 37.3745 28.8223 37.7697 29.108C38.1646 29.3935 38.535 29.746 38.8814 30.165C39.2277 30.5843 39.6437 31.0548 40.1296 31.5771C40.6157 32.0996 41.0408 32.488 41.4051 32.7435L41.7695 32.9622C42.0128 33.1081 42.3286 33.2417 42.7175 33.3632C43.1056 33.4846 43.4457 33.515 43.7377 33.4543L48.4026 33.3815C48.864 33.3815 49.223 33.3051 49.4777 33.1535C49.7329 33.0017 49.8845 32.8344 49.9334 32.6524C49.9821 32.4702 49.9847 32.2636 49.9426 32.0325C49.8994 31.802 49.8568 31.6409 49.8145 31.5498Z" fill="#4B728F"/>
                  </g>
                  <rect x="0.5" y="0.5" width="64" height="45" rx="1.5" stroke="black" stroke-opacity="0.12"/>
                  <defs>
                    <clipPath id="clip0">
                      <rect x="15" y="6" width="35" height="35" fill="white"/>
                    </clipPath>
                  </defs>
                </svg>
              </a>
            </q-tab-panel>

            <q-tab-panel name="registration">
              <div class="text-mini">Зарегистрируйтесь в системе для доступа к образовательным курсам</div>
              <q-input outlined type="text" class=" q-my-md" v-model="user.email" placeholder="Введите ваш е-mail" />
              <q-input v-model="user.password"  :type="isPwd ? 'password' : 'text'"
                       placeholder="Введите пароль..."
                       outlined
                       class="q-my-md">
                <template v-slot:append>
                  <q-icon
                      :name="isPwd ? 'visibility_off' : 'visibility'"
                      class="cursor-pointer"
                      @click="isPwd = !isPwd"
                  />
                </template>
              </q-input>
              <q-input v-model="user.password_confirmation"  :type="isPwd ? 'password' : 'text'"
                       placeholder="Повторите пароль..."
                       outlined
                       class="q-my-md">
                <template v-slot:append>
                  <q-icon
                      :name="isPwd ? 'visibility_off' : 'visibility'"
                      class="cursor-pointer"
                      @click="isPwd = !isPwd"
                  />
                </template>
              </q-input>
              <q-btn color="yellow" class="q-my-md" @click="registerUser" size="16px"  style="width: 100%" label="Далее" />
            </q-tab-panel>
          </q-tab-panels>
        </q-card>
        {{error}}

      </div>
    </div>
  </q-page>
</template>

<script>
import { mapActions } from 'vuex'
export default {
  name: 'PageIndex',
  data () {
    return {
      user: {
        password: null,
        email: null,
        password_confirmation: null
      },
      tab: 'login',
      isPwd: true
    }
  },
  methods: {
    ...mapActions({
      login: 'auth/login'
    }),
    loginUser () {
      this.login(this.user)
        .then(() => {
          this.$router.push('/profile')
        })
    }
  }
}
</script>
<style>
  .title-button{
    font-size: 24px;
    line-height: 24px;
    letter-spacing: 0.18px;
  }
  .text-mini, .text-mini-y{
    font-size: 14px;
    line-height: 20px;
    letter-spacing: 0.25px;
  }
  .text-mini-y{
    color: #FFA000;
  }
  .text-mini{
    color: rgba(0, 0, 0, 0.6);
  }
</style>
